app/controllers/skills_controller.rb

SELECT "skills".* FROM "skills"
---
  def index
    skills = Skill.all

INSERT INTO "skills" ("student_id", "skill", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["skill", "Some new skill"], ["created_at", "2022-08-24 20:30:14.489897"], ["updated_at", "2022-08-24 20:30:14.489897"]]
---
  def create
    skill = Skill.new(
      name: params[:name],
      email: params[:email],
    )
    if skill.save