app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		student_id = params["id"]
		@student = Student.find_by(id: student_id)

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "website_url" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["website_url", "http://www.example.com/"], ["updated_at", "2022-08-24 20:42:35.774746"], ["id", 1]]
---
	def update
		student = Student.find_by(id: params["id"])
		student.first_name = params["first_name"] || student.first_name
		student.last_name = params["last_name"] || student.last_name
		student.email = params["email"] || student.email
		student.phone_number = params["phone_number"] || student.phone_number
		student.short_bio = params["short_bio"] || student.short_bio
		student.linkedin_url = params["linkedin_url"] || student.linkedin_url
		student.twitter_handle = params["twitter_handle"] || student.twitter_handle
		student.website_url = params["website_url"] || student.website_url
		student.resume_url = params["resume_url"] || student.resume_url
		student.github_url = params["github_url"] || student.github_url
		student.photo = params["photo"] || student.photo
		if student.save